In [1]:
import pandas as pd
import numpy as np

np.random.seed(123)

In [7]:
from env import user, password, host

## Create a function named get_db_url. It should accept a username, hostname, password, and database name and 
## return a url connection string formatted like in the example at the start of this lesson.
def get_db_url(user, password, host, db_name):
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'
    
url = get_db_url = get_db_url(user, password, host, 'employees')

In [10]:
## 4. Use your function to obtain a connection to the employees database.
pd.read_sql(' SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

## Once you have successfully run a query:

a. Intentionally make a typo in the database url. What kind of error message do you see?

b. Intentionally make an error in your SQL query. What does the error message look like?

In [ ]:
## 5a. You get an error when you run the connection to the employees database

In [ ]:
## 5b. You get an error for syntax

In [11]:
## 6. Read the employees and titles tables into two separate DataFrames.
#pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)
pd.read_sql('SELECT titles FROM employees, url')

TypeError: read_sql() missing 1 required positional argument: 'con'

In [ ]:
############### EXERCISE SET2

In [12]:
## 1. Copy the users and roles DataFrames from the examples above.
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [13]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [15]:
## 2. What is the result of using a right join on the DataFrames?
# ex. left_df.merge(right_df, how='inner', on=None, left_on=None, right_on=None, 
# left_index=False, right_index=False, indicator=False)

users.merge(roles, how='right', on='id', indicator= True)
# This included everying in the roles and what roles and users df's had in common

   id name_x  role_id     name_y _merge
0   1    bob      1.0      admin   both
1   2    joe      2.0     author   both
2   3  sally      3.0   reviewer   both
3   4   adam      3.0  commenter   both

In [16]:
## 3. What is the result of using an outer join on the DataFrames?

users.merge(roles, how='outer', on='id', indicator= True)
# This included data that was in either df and that in both so all info included

   id name_x  role_id     name_y     _merge
0   1    bob      1.0      admin       both
1   2    joe      2.0     author       both
2   3  sally      3.0   reviewer       both
3   4   adam      3.0  commenter       both
4   5   jane      NaN        NaN  left_only
5   6   mike      NaN        NaN  left_only

In [ ]:
## 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?
# drop the column name in each df